package com.shuangduan.zcy.utils;

public interface Regular {

    String EMAIL_REG = "^\\w+((-\\w+)|(\\.\\w+))*\\@\\w+((\\.|-)\\w+)*\\.\\w+$";
    String URL = "http://(\\w+\\.){2,3}(\\w+)(\\:\\d{2,4})?(\\/(\\w|-)+){0,7}(\\.)(png|jpeg|jpg)";
    String SD_IMG_URL = "((/storage|/mnt)(\\/(\\w|-)+)*.(png|jpg|jpeg))";

    String GU_HUA = "^[0][1-9]{2,3}-[0-9]{5,10}$";
    String TEL_PHONE_REG = "^((13[0-9])|(14[5,7,9])|(15[0-3,5-9])|(166)|(17[0,1,3,5,6,7,8])\" + \"|(18[0-9])|(19[8,9]))\\d{8}$";

    // 定义判别用户身份证号的正则表达式（15位或者18位，最后一位可以为字母）
    String ID_CARE_NO = "(^[1-9]\\d{5}(18|19|20)\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$)|" +
            "(^[1-9]\\d{5}\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}$)";

}
